Repository: MPasara/e_commerce
Catalog: lib/l10n/intl_*.arb
Languages: hr

# emailHint
source: example@email.com
hr: primjer@email.com

# passwordHint
source: Enter account password
hr: Unesite lozinku računa

# confirmPasswordHint
source: Confirm password
hr: Potvrdite lozinku

# passwordValidationError
source: Password must be at least 6 characters
hr: Lozinka mora imati najmanje 6 znakova

# loginWelcomeTitle
source: Welcome back to Shopzy
hr: Dobrodošli natrag u Shopzy

# loginSubtitle
source: Please enter your login details
hr: Molimo unesite svoje podatke za prijavu

# emailLabel
source: Email
hr: E-pošta

# passwordLabel
source: Password
hr: Lozinka

# signInButton
source: Sign in
hr: Prijavi se

# orDivider
source: OR
hr: ILI

source: Forgot Password
hr: Zaboravljena lozinka

source: Sign Up
hr: Registriraj se

# registerTitle
source: Register Account
hr: Registracija računa

# registerSubtitle
source: Enter Email and Password to register
hr: Unesite e-poštu i lozinku za registraciju

# confirmPasswordLabel
source: Confirm Password
hr: Potvrdite lozinku

# registerButton
source: Register
hr: Registriraj se

# requiredFieldError
source: This field is required
hr: Ovo polje je obavezno

source: Passwords do not match
hr: Lozinke se ne podudaraju

# loginFailed
source: Login failed: No session created
hr: Prijava nije uspjela: Sesija nije kreirana

# signUpFailed
source: Sign up failed: No session created
hr: Registracija nije uspjela: Sesija nije kreirana

source: Social sign-in failed
hr: Društvena prijava nije uspjela

# appleIdTokenNotFound
source: Could not find ID Token from generated credential.
hr: ID token nije pronađen iz generiranih vjerodajnica.

# googleSignInCancelled
source: Google sign in was cancelled by the user.
hr: Google prijava je otkazana od strane korisnika.

# googleAccessTokenNotFound
source: No Access Token found.
hr: Token za pristup nije pronađen.

# googleIdTokenNotFound
source: No ID Token found.
hr: ID token nije pronađen.

# signOutFailed
source: Failed to sign out: {error}
hr: Odjava nije uspjela: {error}
